** use mousex and y for non-MIDI controller interaction 
- Load up overtone and apollo samples

This uses mouse-x to change centerpos, which suggests you are actively
moving with a mouse (most convenient when working as laptop using
trackpad)

Note, these are DEFINST
#+BEGIN_SRC clojure :results output
(definst grainy-ctl-mousex [b 0 trate 1 amp 0.8]
  (let [trate trate
        dur (/ 2 trate)]
    (t-grains:ar 1 (impulse:ar trate) b 1 ;; mouse-x (no line/random)
                 (mouse-x:kr 0 (buf-dur:kr b)) dur
                 0 amp 2)))




#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :results silent
(def viol1 (grainy-ctl-mousex :b 1 :trate 0.25))
#+END_SRC

#+BEGIN_SRC clojure
(ctl grainy-ctl-mousex :trate 0.5)
#+END_SRC


#+BEGIN_SRC clojure :results output
  (definst mouse-grain-y [b 0 trate-mousey-min 1  dur-numerator 2]
    (let [trate (mouse-y:kr trate-mousey-min 16)
          dur (/ dur-numerator trate)]
      (t-grains:ar 1 (impulse:ar trate) b 1 ;; mouse x/y (no line/random)
                   (mouse-x:kr 0 (buf-dur:kr b)) dur 
                   0 0.8 2)))



#+END_SRC

#+RESULTS:
: Sending:  /g_new [47 1 31]
: Sending:  /sync [25]
: Sending:  /g_new [48 0 47]
: Sending:  /sync [26]
: Sending:  /g_new [49 1 47]
: Sending:  /sync [27]
: Sending:  /s_new [overtone.stu547/mono-inst-mixer 50 1 47 in-bus 18.0 out-bus 0.0 volume 1.0 pan 0.0]

: Sending:  /sync [28]

#+BEGIN_SRC clojure :results silent
  (mouse-grain-y 2 :dur-numerator 4)

;;  (ctl mouse-grain-y 2 :dur-numerator 2)
#+END_SRC
It would be nice to also have a way to mostly automate listening
behind the scenes with lines as centerpos and small mouse-x changes
for some parameter variation
** print out mouse x and y values 
:PROPERTIES:
:DATE_CREATED: [2017-02-11 Sat 09:33]
:END:

Won't print out to REPL from a babel-block, hmm?
#+BEGIN_SRC clojure 
(let [t 2] (do (run 30 (poll:kr (impulse:kr t) (mouse-y) "mouse-y:"))
               (run 30 (poll:kr (impulse:kr t) (mouse-x) "mouse-x:" ))
               (run 30 (poll:kr (impulse:kr t) (+ 0.0) (str " " \newline \newline)))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 108>

*** mouse-rand-grain1
:PROPERTIES:
:DATE_CREATED: [2017-02-11 Sat 13:23]
:ID:       6846EBE5-14EA-4655-8855-1F674FCBAB1D
:END:
Link to a gran sysnth player with randomness

#+BEGIN_SRC clojure
  (defsynth mouse-rand-grain
    [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
    (let [trate (mouse-y:kr 0.5 20)
          dur (/ dur-numerator trate)
          clk (impulse:kr trate)
          centerpos (+ (mouse-x:kr 0 (* 0.5 (buf-dur:kr buffer))) (t-rand:kr 0 0.01 clk))]
      (out 0 (pan2 
              (t-grains:ar 1 clk buffer 1 ;; mouse x/y and t-rand
                           centerpos dur 
                           0 amp 2 )))))

#+END_SRC

#+RESULTS:
: #<synth: mouse-rand-grain>

#+BEGIN_SRC clojure 
(mouse-rand-grain 7)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/mouse-rand-grain 50>

*** [#A] interesting use of interaction and randomness (muose-rand-grain2 uses =line=)
:PROPERTIES:
:ID:       95FDE12A-8C18-42A9-8500-5619E3ACF461
:END:
Uses a mouse-x and a slowly advancing =line= to work against each
other and make the centerpos stay more or less one place.

What's the name for this kind of technique of scaling etc.? It reminds
me of Ivan of Teixera--error correction doesn't quite do it.

The idea is "smoothing," reducing out jumps of values that are the
result of unnecessarily noisy readings?

#+NAME: mouse-rand-grain2-def
#+BEGIN_SRC clojure :results silent
(defsynth mouse-rand-grain2
  [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
  (let [trate (mouse-y:kr 0.5 20)
        track-len (buf-dur:kr buffer)
        dur (/ dur-numerator trate)
        clk (impulse:kr trate)
        line-centerpos (+ (mouse-x:kr 0 (buf-dur:kr buffer))
                          (line:kr 0 (* 0.5 track-len) (* 2 track-len))
                          (t-rand:kr 0 0.01 clk))]
    (out 0 (pan2 
            (t-grains:ar 1 clk buffer ;; mouse x/y and line and rand
                         1 line-centerpos dur 0 amp 2 )))))

#+END_SRC         

#+RESULTS:
: #<synth: mouse-rand-grain2>

         
#+BEGIN_SRC clojure 
(def pasdaction-gran (mouse-rand-grain2 7))
#+END_SRC

#+RESULTS:
: #'user/pasdaction-gran

*** [#A] granular with g-verb
    :PROPERTIES:
    :ID:       8E237C21-866C-4BD8-8681-4AB843BDFA1C
    :END:

#+NAME: mouse-rand-grain3-def
#+BEGIN_SRC clojure :results silent
    (defsynth mouse-rand-grain3
  "Summary of arglist: buffer; trate; amp; centerpos; AND then reverb args...
  roomsize; revtime; damping; inputbw; drylevel; earlyreflevel; taillevel; maxroomsize"
      [buffer 0 trate 1
       dur-numerator 12 amp 0.8
       centerpos 0 roomsize 10
       revtime 5 damping 0.5
       inputbw 0.2 drylevel 0.1
       earlyreflevel 0.7 taillevel 0.5
       maxroomsize 300]
      (let [trate (mouse-y:kr 0.5 20)
            track-len (buf-dur:kr buffer)
            dur (/ dur-numerator trate)
            clk (impulse:kr trate)
            line-centerpos (+ (mouse-x:kr 0 (buf-dur:kr buffer))
                              (line:kr 0 (* 0.5 track-len) (* 2 track-len))
                              (t-rand:kr 0 0.01 clk))]
        (out 0 (pan2 (g-verb  
                (t-grains:ar 1 clk buffer 1 ;; mouse x, line, rand, reverb
                             line-centerpos dur 
                             0 amp 2 ) )))))
#+END_SRC

#+BEGIN_SRC clojure :results output
(def pasdaction-grand (mouse-rand-grain3 :buffer 7 :amp 0.1))
#+END_SRC

#+RESULTS:
: Sending:  /s_new [user/mouse-rand-grain3 42 1 7 roomsize 10.0 earlyreflevel 0.7 taillevel 0.5 dur-numerator 12.0 buffer 7.0 maxroomsize 300.0 trate 1.0 amp 0.1 revtime 5.0 centerpos 0.0 inputbw 0.2 damping 0.5 drylevel 0.1]

#+BEGIN_SRC clojure :results silent
(def apotheose-grand (mouse-rand-grain3 :buffer 3 :amp 0.1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def coda-grand (mouse-rand-grain3 :buffer 4 :amp 0.1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl mouse-rand-grain3 :amp 0.1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl mouse-rand-grain3 : 0.1)
#+END_SRC

*** making sin-osc FM noise (using ctl with many parameters)

 #+BEGIN_SRC clojure 
   ;; This buffer is for Clojure experiments and evaluation.
   ;; Press C-j to evaluate the last expression.
   (stop)

   (demo (rhpf (pan2 (* (lf-tri:kr 5) (lf-tri 220)))))

   (run 4 (poll:kr (impulse:kr 2) (line:kr 0 10 3 INF)))
   (run 20 (poll:kr (impulse:kr 2) (phasor:kr :start 0 :end 10)))
   (node? "Overtone Root")

   (group-deep-clear 34)
   (foundation-overtone-group)
   (kill-server)
   (boot-server)

   (overtone.repl.ugens/find-ugen)

 #+END_SRC

 #+BEGIN_SRC clojure
   (defsynth running [freq 1000 amp 0.5 w 100 x 10 y1 1 y2 1 z 0.1]
     (out 0 (rlpf (sin-osc (* freq (phasor:kr (impulse:kr y1) y2 0 x))))))

   (def the-tunes (running))

#+END_SRC

#+RESULTS:
: #<synth: running>#'user/the-tunes

#+BEGIN_SRC clojure
   (ctl the-tunes :y1 0)
#+END_SRC

#+RESULTS:
: #<synth-node[live]: user/running 36>

#+BEGIN_SRC clojure
   (on-event [:midi :control-change]
             (fn [{cc-channel :note vel :velocity}]
               (cond (= cc-channel 1) (ctl the-tunes :freq (scale-range vel 1 127 0.1 1000))
                     (= cc-channel 2) (ctl the-tunes :y1 (scale-range vel 1 127 0.1 20))
                     (= cc-channel 3) (ctl the-tunes :y2 (scale-range vel 1 127 0.1 30))))
             ::the-tunes-control)



   (remove-event-handler ::the-tunes-control)

 #+END_SRC

*** pulse-divider use
#+BEGIN_SRC clojure
  (defsynth env-tunes [freq 300 amp 1]
    (out 0 (* amp
              (env-gen (lin 0.4 1 0.4 0.5) 1 1 0 2)
              (+ (sin-osc (/ freq 2))
                 (rlpf (saw freq) (* 1.1 freq) 0.4)))))

  (def check-env-tunes (env-tunes))


  (ctl check-env-tunes :freq 400)


#+END_SRC

#+BEGIN_SRC clojure
(demo 10
        (let [src1      (sin-osc 440)
              src2      (sin-osc 880)
              root-trig (impulse:kr 10)
              t1        (pulse-divider:kr root-trig 20)
              t2        (pulse-divider:kr root-trig 10)]
          (* 100
             (+ (* (decay t1 0.1) src1)
                (* (decay t2 0.1) src2)))))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: quilbabel.core/audition-synth 46>

#+BEGIN_SRC clojure :results silent
  (demo 10 (sin-osc (+ 1000 (* 600 (lf-noise0:kr 12))) 0.3))
#+END_SRC

*** ring modulation with resonz examples
 #+BEGIN_SRC clojure
 ;;(demo 10 (ring1 (* 0.4 (rlpf (resonz (saw) 1000 ) 1000 10)) (* 3 (lf-noise0 30))))
 (demo 30 (ring3 (* 100 (rlpf (resonz (saw) 100 ) 1000 10)) (* 3 (lf-noise0 100))))
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: quilbabel.core/audition-synth 49>

*** a many parametered inst template (for ring modulation experiment)

 #+BEGIN_SRC clojure
 (definst d1 [param1 10 param2 100 param3 1000 param4 10 param5 100] (ring3 (* param1 (rlpf (resonz (saw) param2 ) param3 10)) (* param4 (lf-noise0 param5))))
 #+END_SRC


    #+RESULTS:
    : #<instrument: d1>

 #+BEGIN_SRC clojure
 (kill my-d1)
 #+END_SRC

 #+RESULTS:
 : nil

 #+BEGIN_SRC clojure
 (def my-d1 (d1))
 #+END_SRC

 #+RESULTS:
 : #'user/my-d1

 #+BEGIN_SRC clojure
 (ctl my-d1 :param1 20 :param2 50 :param3 400 :param4 10 :param5 10)
 #+END_SRC

 #+RESULTS:
 : #<synth-node[live]: user/d1 53>

#+NAME: list-all-cc
 #+BEGIN_SRC clojure
   (on-event [:midi :control-change]
             (fn [{cc-channel :note vel :velocity chan :channel}]
	       (println (list cc-channel vel chan)))
	       ::list-all)
 #+END_SRC

 #+RESULTS: list-all-cc
 : :added-async-handler

#+NAME: list-all-cc-remove
 #+BEGIN_SRC clojure :results silent
 (remove-event-handler ::list-all)
 #+END_SRC

#+BEGIN_SRC clojure :results silent
   (on-event [:midi :note-on]
             (fn [{cc-channel :note vel :velocity chan :channel}]
	       (println (list cc-channel vel chan)))
	       ::list-all-notes)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::list-all-notes)
#+END_SRC
** [#A] some ugen tests
   :PROPERTIES:
   :DATE_CREATED: [2017-02-28 Tue 16:00]
   :END:

#+BEGIN_SRC clojure :results silent
(demo (pan2 (sin-osc)))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 1 (pan2 (* 10 (rlpf (saw) (line 20 6e3 0.5) 1))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 0.75 (pan2 (* 30 (comb-n (bpf (pink-noise) (line 20 6e3 0.5) 1) 0.4 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 400 (bpf (pink-noise) 1000 0.01))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 10.1 (klang [[1000 440 260]]))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 10 (+ (* 40 (bpf (pink-noise) 1000 0.01))
                         (klang [(choose-n 4 (map #(+ % 200) (range 1 100)))])))))
#+END_SRC

#+BEGIN_SRC clojure :results value
(rand-nth (map #(* % 10) (range 1 100)))
#+END_SRC

#+RESULTS:
: 850

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 2 (+ (* 40 (bpf (pink-noise) (scale-range (rand) 0 1 500 1000) 0.01))
                         (klang [(choose-n 10 (map #(+ % 400) (range
                                                               1 ;;10
                                                               100 ;;1000
                                                               )))])))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 40 (comb-n (bpf (pink-noise) (line 20 6e3 10) 1) 0.9 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 20  (comb-n (bpf (saw (+ 100 (lf-noise0:kr))) (line 20 6e3 10) 1) 0.9 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 2.5  (saw (+ 400 (* 100 (lf-pulse:kr 10)))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(stop)
#+END_SRC
***** why providing values to demo cause problems?? why?
 #+BEGIN_SRC clojure :results silent
 (let [track-length 30 seconds-duration (reciprocal track-length) ]
   (demo seconds-duration
         (pan2 (bpf (pink-noise)
                    (phasor:kr (impulse:kr seconds-duration) seconds-duration 100 1000 100)))))

 #+END_SRC

 #+BEGIN_SRC clojure
 (let [track-length 10
       per-second (reciprocal track-length)]
   (run (poll:kr (impulse:kr track-length)
                 (phasor:kr (impulse:kr per-second) per-second 100 1000 100))))
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: user/audition-synth 54>

 #+BEGIN_SRC clojure
 (let [track-length 10
       per-second (reciprocal track-length)]
   (demo track-length (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr per-second) per-second 100 1000 100)))))
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC clojure :results silent
   (demo 30 (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100))))
 #+END_SRC

 #+BEGIN_SRC clojure :results silent
 (let [track-length 30
       every-x-seconds (reciprocal track-length)]
   (demo track-length (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100)))))
 #+END_SRC

 #+BEGIN_SRC clojure :results silent
 (let [x 30
 ;;      y (reciprocal x)
 ]
   (demo 30 (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr (reciprocal 30)) (reciprocal 30) 100 1000 100)))))
 #+END_SRC

***** re-bind demo-time how?
 dynamically in a let yeah? use =binding= form as per Emerick?

 #+BEGIN_SRC clojure :results silent
 (let [*demo-time* 100] 
   (demo (sin-osc)))
 #+END_SRC


 #+BEGIN_SRC clojure :results output
 (let [*demo-time* 100 
       _ (println *demo-time*)
       _ (demo (sin-osc))])
 #+END_SRC

 #+RESULTS:
 : 100

 #+BEGIN_SRC clojure :results output

 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC clojure :results silent
 (let [x 30
 *demo-time* (* x 1000)
       y (reciprocal x)
 ]
   (demo (pan2 (bpf (pink-noise)
                 (phasor:kr (impulse:kr y) y 100 1000 100)))))
 #+END_SRC

*** create the macro!
    :PROPERTIES:
    :DATE_CREATED: [2017-03-03 Fri 09:50]
    :END:
First of all, prefer =case= to =cond=
#+BEGIN_SRC clojure
;;       16 (ctl active-synth :room16 (scale-range vel 1 127 0.1 10))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(= cc-channel 5) 
(do (reset! instrument1-cc0-1-lo (scale-range vel 1 127 rlolo-1 rlohi-1))
    (reset! instrument1-cc0-2-lo (scale-range vel 1 127 rlolo-2 rlohi-2))
    (println (str @instrument1-cc0-1-lo) (str @instrument1-cc0-2-lo)))
#+END_SRC


#+NAME: cc-knob-scale-range-macro
#+BEGIN_SRC clojure :results silent
(defmacro test [active-synth cc-knob tar-lo tar-hi vel]
  `(ctl ~active-synth ~cc-knob (scale-range ~vel 1 127 ~tar-lo ~tar-hi)))
#+END_SRC

#+BEGIN_SRC clojure
(macroexpand-1 '(test sympth :cc0-1 0 100))
#+END_SRC

#+RESULTS:
| overtone.live/ctl | sympth | :cc0-1 | (overtone.live/scale-range user/vel 1 127 0 100) |

#+BEGIN_SRC clojure
(defn simple-test [active-synth double-colon-name]
  (on-event
   [:midi :control-change]
   (fn [{cc-channel :note vel :velocity}]
     (case cc-channel
       1 (test active-synth :cc0-1 0 100 vel)
       2 (test active-synth :cc0-2 0 100 vel)
       3 (test active-synth :cc0-3 0 100 vel)
       4 (test active-synth :cc0-4 0 100 vel)
       5 (test active-synth :cc0-5 0 100 vel)
       6 (test active-synth :cc0-6 0 100 vel)
       7 (test active-synth :cc0-7 0 100 vel)
       8 (test active-synth :cc0-8 0 100 vel)
       ))
   double-colon-name))
#+END_SRC

#+RESULTS:
: #'user/simple-test

#+BEGIN_SRC clojure :results silent
(simple-test filterable-background ::simple-test-handler)
#+END_SRC
***** create synths
See granular synth defined for minilogue cc knobs
[[id:ABD50379-307B-44F0-BA31-7540257029DC][minilogue for grains]]

#+CALL: minirand-ccgrain-no-line()

#+BEGIN_SRC clojure :results silent
(def mini-obsessive (minirand-ccgrain-no-line 3))
#+END_SRC

#+BEGIN_SRC clojure :results silent
;; (cc-minilogue1-grains mini-obsessive ::obess)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(mini-scaling-test mini-obsessive ::mini-obsess)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::mini-obsess)
;; (remove-event-handler ::obess)
#+END_SRC


#+BEGIN_SRC clojure :results silent
(defsynth mini-filterable-synth
  [cc34 1
   cc35 1
   cc36 200]
  (out 0 (pan2 (* cc34 (resonz (brown-noise) cc36 cc35)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
 (def filterable-synth (mini-filterable-synth))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(mini-scaling-test filterable-synth ::mini-filt)
#+END_SRC

#+NAME: call-me-remote
#+begin_SRC clojure
(rand)
#+END_SRC

#+RESULTS: call-me-remote
: 0.9825551664091691

#+CALL: call-me-remote()

#+RESULTS:
: 0.3852873461500559
* recording
#+BEGIN_SRC clojure
;;  (recording-start "~/Google Drive/ministrings.wav")
;; (recording-start "~/Google Drive/static-yancey-goldberg4.wav")
(recording-start "~/Google Drive/static-yancey-goldberg5.wav")
#+END_SRC

#+RESULTS:
: :recording-started

#+NAME: stop-recording
#+BEGIN_SRC clojure
  (recording-stop)
#+END_SRC

#+RESULTS: stop-recording
: /Users/a/Google Drive/static-yancey-goldberg5.wav

#+RESULTS:
: /Users/a/Google Drive/yancey-reich.wav


**** Yancey cc-knob functions (used by simple8)
#+BEGIN_SRC clojure :results silent
(defn cc-one [active-synth vel] (ctl active-synth :trate (scale-range vel 1 127 0.1 10)))
(defn cc-two [active-synth vel] (ctl active-synth :dur-numerator (scale-range vel 1 127 0.1 24)))
(defn cc-three [active-synth vel] (ctl active-synth :centerpos (scale-range vel 1 127 0 272)))
(defn cc-four [active-synth vel] (ctl active-synth :amp (scale-range vel 1 127 0 1)))
#+END_SRC

#+RESULTS:
: #'user/cc-one#'user/cc-two#'user/cc-three#'user/cc-four

**** Goldberg cc-knob functions (used by simple8)
#+BEGIN_SRC clojure :results silent

(defn cc-five [active-synth vel] (ctl active-synth :trate (scale-range vel 1 127 0.1 10)))
(defn cc-six [active-synth vel] (ctl active-synth :dur-numerator (scale-range vel 1 127 0.1 24)))
(defn cc-seven [active-synth vel] (ctl active-synth :centerpos (scale-range vel 1 127 0 184)))
(defn cc-eight [active-synth vel] (ctl active-synth :amp (scale-range vel 1 127 0 1)))

#+END_SRC

#+RESULTS:
: #'user/cc-five#'user/cc-six#'user/cc-seven#'user/cc-eight

** use "sample number" to move through centerpos values
#+BEGIN_SRC clojure :results silent
(defn swap-centerpos-in-samples-pad [active-synth1 active-synth2]
  (fn [{pad :note}]
    (case pad
      36 (do (swap! centerpos1 #(- % 100)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      37 (do (swap! centerpos1 #(- % 1000)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      38 (do (swap! centerpos2 #(- % 100)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      39 (do (swap! centerpos2 #(- % 1000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      40 (do (swap! centerpos1 #(+ % 100)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      41 (do (swap! centerpos1 #(+ % 1000)) (ctl active-synth1 :centerpos (/ @centerpos1 44100)))
      42 (do (swap! centerpos2 #(+ % 1000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100)))
      43 (do (swap! centerpos2 #(+ % 10000)) (ctl active-synth2 :centerpos (/ @centerpos2 44100))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(on-event [:midi :note-on]
          (swap-centerpos-in-samples-pad yancey-noline goldberg-noline)
          ::pad-control-yancey-centerpos-in-samples)
#+END_SRC

#+BEGIN_SRC clojure :results silent
;; (remove-event-handler ::pad-control-yancey-centerpos-in-samples)
#+END_SRC

#+BEGIN_SRC clojure
(list @centerpos1 @centerpos2)
#+END_SRC

#+RESULTS:
| 71300 | 7323600.1 |


** studio* at startup of overtone
#+BEGIN_SRC clojure
#atom[{:synth-group nil,
       :instruments {},
       :instrument-group #<synth-group[live]: Studio 31>,
       :master-volume 0.8, :input-gain 1,
       :bus-mixers {:in (#<synth-node[live]: overtone.studiod9b/in-bus-mixer 23>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 24>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 25>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 26>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 27>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 28>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 29>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 30>),
                    :out (#<synth-node[live]: overtone.studid9b/out-bus-mixer 15>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 16>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 17>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 18>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 19>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 20>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 21>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 22>)},
       :recorder nil} 0x111b613c]
#+END_SRC

#+BEGIN_SRC clojure :results output
(pp-node-tree)
#+END_SRC

#+RESULTS:
#+begin_example
{:type :group,
 :id 4,
 :name "Overtone Root",
 :children
 ({:type :group, :id 31, :name "Studio", :children nil}
  {:type :group,
   :id 5,
   :name "Overtone User",
   :children
   ({:type :group,
     :id 6,
     :name "Overtone Safe Pre Default",
     :children nil}
    {:type :group, :id 7, :name "Overtone Default", :children nil}
    {:type :group,
     :id 8,
     :name "Overtone Safe Post Default",
     :children nil})})}
#+end_example

